wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_core.h
/*
 *******************************************************************************
    @file     reg_core.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_CORE_H
#define __REG_CORE_H


#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief UID type pointer Definition
  */
#define UID_BASE                        (0x1FFFF7E8U)                           /*!< Unique device ID register base address */

/**
  * @brief Nested Vectored Interrupt Controller
  */

/**
  * @brief NVIC_ISER Register Bit Definition
  */
#define NVIC_ISER_SETENA                (0xFFFFFFFFU)                           /*!< Interrupt set enable bits */
#define NVIC_ISER_SETENA_0              (0x00000001U)                           /*!< bit 0 */
#define NVIC_ISER_SETENA_1              (0x00000002U)                           /*!< bit 1 */
#define NVIC_ISER_SETENA_2              (0x00000004U)                           /*!< bit 2 */
#define NVIC_ISER_SETENA_3              (0x00000008U)                           /*!< bit 3 */
#define NVIC_ISER_SETENA_4              (0x00000010U)                           /*!< bit 4 */
#define NVIC_ISER_SETENA_5              (0x00000020U)                           /*!< bit 5 */
#define NVIC_ISER_SETENA_6              (0x00000040U)                           /*!< bit 6 */
#define NVIC_ISER_SETENA_7              (0x00000080U)                           /*!< bit 7 */
#define NVIC_ISER_SETENA_8              (0x00000100U)                           /*!< bit 8 */
#define NVIC_ISER_SETENA_9              (0x00000200U)                           /*!< bit 9 */
#define NVIC_ISER_SETENA_10             (0x00000400U)                           /*!< bit 10 */
#define NVIC_ISER_SETENA_11             (0x00000800U)                           /*!< bit 11 */
#define NVIC_ISER_SETENA_12             (0x00001000U)                           /*!< bit 12 */
#define NVIC_ISER_SETENA_13             (0x00002000U)                           /*!< bit 13 */
#define NVIC_ISER_SETENA_14             (0x00004000U)                           /*!< bit 14 */
#define NVIC_ISER_SETENA_15             (0x00008000U)                           /*!< bit 15 */
#define NVIC_ISER_SETENA_16             (0x00010000U)                           /*!< bit 16 */
#define NVIC_ISER_SETENA_17             (0x00020000U)                           /*!< bit 17 */
#define NVIC_ISER_SETENA_18             (0x00040000U)                           /*!< bit 18 */
#define NVIC_ISER_SETENA_19             (0x00080000U)                           /*!< bit 19 */
#define NVIC_ISER_SETENA_20             (0x00100000U)                           /*!< bit 20 */
#define NVIC_ISER_SETENA_21             (0x00200000U)                           /*!< bit 21 */
#define NVIC_ISER_SETENA_22             (0x00400000U)                           /*!< bit 22 */
#define NVIC_ISER_SETENA_23             (0x00800000U)                           /*!< bit 23 */
#define NVIC_ISER_SETENA_24             (0x01000000U)                           /*!< bit 24 */
#define NVIC_ISER_SETENA_25             (0x02000000U)                           /*!< bit 25 */
#define NVIC_ISER_SETENA_26             (0x04000000U)                           /*!< bit 26 */
#define NVIC_ISER_SETENA_27             (0x08000000U)                           /*!< bit 27 */
#define NVIC_ISER_SETENA_28             (0x10000000U)                           /*!< bit 28 */
#define NVIC_ISER_SETENA_29             (0x20000000U)                           /*!< bit 29 */
#define NVIC_ISER_SETENA_30             (0x40000000U)                           /*!< bit 30 */
#define NVIC_ISER_SETENA_31             (0x80000000U)                           /*!< bit 31 */

/**
  * @brief NVIC_ICER Register Bit Definition
  */
#define NVIC_ICER_CLRENA                (0xFFFFFFFFU)                           /*!< Interrupt clear-enable bits */
#define NVIC_ICER_CLRENA_0              (0x00000001U)                           /*!< bit 0 */
#define NVIC_ICER_CLRENA_1              (0x00000002U)                           /*!< bit 1 */
#define NVIC_ICER_CLRENA_2              (0x00000004U)                           /*!< bit 2 */
#define NVIC_ICER_CLRENA_3              (0x00000008U)                           /*!< bit 3 */
#define NVIC_ICER_CLRENA_4              (0x00000010U)                           /*!< bit 4 */
#define NVIC_ICER_CLRENA_5              (0x00000020U)                           /*!< bit 5 */
#define NVIC_ICER_CLRENA_6              (0x00000040U)                           /*!< bit 6 */
#define NVIC_ICER_CLRENA_7              (0x00000080U)                           /*!< bit 7 */
#define NVIC_ICER_CLRENA_8              (0x00000100U)                           /*!< bit 8 */
#define NVIC_ICER_CLRENA_9              (0x00000200U)                           /*!< bit 9 */
#define NVIC_ICER_CLRENA_10             (0x00000400U)                           /*!< bit 10 */
#define NVIC_ICER_CLRENA_11             (0x00000800U)                           /*!< bit 11 */
#define NVIC_ICER_CLRENA_12             (0x00001000U)                           /*!< bit 12 */
#define NVIC_ICER_CLRENA_13             (0x00002000U)                           /*!< bit 13 */
#define NVIC_ICER_CLRENA_14             (0x00004000U)                           /*!< bit 14 */
#define NVIC_ICER_CLRENA_15             (0x00008000U)                           /*!< bit 15 */
#define NVIC_ICER_CLRENA_16             (0x00010000U)                           /*!< bit 16 */
#define NVIC_ICER_CLRENA_17             (0x00020000U)                           /*!< bit 17 */
#define NVIC_ICER_CLRENA_18             (0x00040000U)                           /*!< bit 18 */
#define NVIC_ICER_CLRENA_19             (0x00080000U)                           /*!< bit 19 */
#define NVIC_ICER_CLRENA_20             (0x00100000U)                           /*!< bit 20 */
#define NVIC_ICER_CLRENA_21             (0x00200000U)                           /*!< bit 21 */
#define NVIC_ICER_CLRENA_22             (0x00400000U)                           /*!< bit 22 */
#define NVIC_ICER_CLRENA_23             (0x00800000U)                           /*!< bit 23 */
#define NVIC_ICER_CLRENA_24             (0x01000000U)                           /*!< bit 24 */
#define NVIC_ICER_CLRENA_25             (0x02000000U)                           /*!< bit 25 */
#define NVIC_ICER_CLRENA_26             (0x04000000U)                           /*!< bit 26 */
#define NVIC_ICER_CLRENA_27             (0x08000000U)                           /*!< bit 27 */
#define NVIC_ICER_CLRENA_28             (0x10000000U)                           /*!< bit 28 */
#define NVIC_ICER_CLRENA_29             (0x20000000U)                           /*!< bit 29 */
#define NVIC_ICER_CLRENA_30             (0x40000000U)                           /*!< bit 30 */
#define NVIC_ICER_CLRENA_31             (0x80000000U)                           /*!< bit 31 */

/**
  * @brief NVIC_ISPR Register Bit Definition
  */
#define NVIC_ISPR_SETPEND               (0xFFFFFFFFU)                           /*!< Interrupt set-pending bits */
#define NVIC_ISPR_SETPEND_0             (0x00000001U)                           /*!< bit 0 */
#define NVIC_ISPR_SETPEND_1             (0x00000002U)                           /*!< bit 1 */
#define NVIC_ISPR_SETPEND_2             (0x00000004U)                           /*!< bit 2 */
#define NVIC_ISPR_SETPEND_3             (0x00000008U)                           /*!< bit 3 */
#define NVIC_ISPR_SETPEND_4             (0x00000010U)                           /*!< bit 4 */
#define NVIC_ISPR_SETPEND_5             (0x00000020U)                           /*!< bit 5 */
#define NVIC_ISPR_SETPEND_6             (0x00000040U)                           /*!< bit 6 */
#define NVIC_ISPR_SETPEND_7             (0x00000080U)                           /*!< bit 7 */
#define NVIC_ISPR_SETPEND_8             (0x00000100U)                           /*!< bit 8 */
#define NVIC_ISPR_SETPEND_9             (0x00000200U)                           /*!< bit 9 */
#define NVIC_ISPR_SETPEND_10            (0x00000400U)                           /*!< bit 10 */
#define NVIC_ISPR_SETPEND_11            (0x00000800U)                           /*!< bit 11 */
#define NVIC_ISPR_SETPEND_12            (0x00001000U)                           /*!< bit 12 */
#define NVIC_ISPR_SETPEND_13            (0x00002000U)                           /*!< bit 13 */
#define NVIC_ISPR_SETPEND_14            (0x00004000U)                           /*!< bit 14 */
#define NVIC_ISPR_SETPEND_15            (0x00008000U)                           /*!< bit 15 */
#define NVIC_ISPR_SETPEND_16            (0x00010000U)                           /*!< bit 16 */
#define NVIC_ISPR_SETPEND_17            (0x00020000U)                           /*!< bit 17 */
#define NVIC_ISPR_SETPEND_18            (0x00040000U)                           /*!< bit 18 */
#define NVIC_ISPR_SETPEND_19            (0x00080000U)                           /*!< bit 19 */
#define NVIC_ISPR_SETPEND_20            (0x00100000U)                           /*!< bit 20 */
#define NVIC_ISPR_SETPEND_21            (0x00200000U)                           /*!< bit 21 */
#define NVIC_ISPR_SETPEND_22            (0x00400000U)                           /*!< bit 22 */
#define NVIC_ISPR_SETPEND_23            (0x00800000U)                           /*!< bit 23 */
#define NVIC_ISPR_SETPEND_24            (0x01000000U)                           /*!< bit 24 */
#define NVIC_ISPR_SETPEND_25            (0x02000000U)                           /*!< bit 25 */
#define NVIC_ISPR_SETPEND_26            (0x04000000U)                           /*!< bit 26 */
#define NVIC_ISPR_SETPEND_27            (0x08000000U)                           /*!< bit 27 */
#define NVIC_ISPR_SETPEND_28            (0x10000000U)                           /*!< bit 28 */
#define NVIC_ISPR_SETPEND_29            (0x20000000U)                           /*!< bit 29 */
#define NVIC_ISPR_SETPEND_30            (0x40000000U)                           /*!< bit 30 */
#define NVIC_ISPR_SETPEND_31            (0x80000000U)                           /*!< bit 31 */

/**
  * @brief NVIC_ICPR Register Bit Definition
  */
#define NVIC_ICPR_CLRPEND               (0xFFFFFFFFU)                           /*!< Interrupt clear-pending bits */
#define NVIC_ICPR_CLRPEND_0             (0x00000001U)                           /*!< bit 0 */
#define NVIC_ICPR_CLRPEND_1             (0x00000002U)                           /*!< bit 1 */
#define NVIC_ICPR_CLRPEND_2             (0x00000004U)                           /*!< bit 2 */
#define NVIC_ICPR_CLRPEND_3             (0x00000008U)                           /*!< bit 3 */
#define NVIC_ICPR_CLRPEND_4             (0x00000010U)                           /*!< bit 4 */
#define NVIC_ICPR_CLRPEND_5             (0x00000020U)                           /*!< bit 5 */
#define NVIC_ICPR_CLRPEND_6             (0x00000040U)                           /*!< bit 6 */
#define NVIC_ICPR_CLRPEND_7             (0x00000080U)                           /*!< bit 7 */
#define NVIC_ICPR_CLRPEND_8             (0x00000100U)                           /*!< bit 8 */
#define NVIC_ICPR_CLRPEND_9             (0x00000200U)                           /*!< bit 9 */
#define NVIC_ICPR_CLRPEND_10            (0x00000400U)                           /*!< bit 10 */
#define NVIC_ICPR_CLRPEND_11            (0x00000800U)                           /*!< bit 11 */
#define NVIC_ICPR_CLRPEND_12            (0x00001000U)                           /*!< bit 12 */
#define NVIC_ICPR_CLRPEND_13            (0x00002000U)                           /*!< bit 13 */
#define NVIC_ICPR_CLRPEND_14            (0x00004000U)                           /*!< bit 14 */
#define NVIC_ICPR_CLRPEND_15            (0x00008000U)                           /*!< bit 15 */
#define NVIC_ICPR_CLRPEND_16            (0x00010000U)                           /*!< bit 16 */
#define NVIC_ICPR_CLRPEND_17            (0x00020000U)                           /*!< bit 17 */
#define NVIC_ICPR_CLRPEND_18            (0x00040000U)                           /*!< bit 18 */
#define NVIC_ICPR_CLRPEND_19            (0x00080000U)                           /*!< bit 19 */
#define NVIC_ICPR_CLRPEND_20            (0x00100000U)                           /*!< bit 20 */
#define NVIC_ICPR_CLRPEND_21            (0x00200000U)                           /*!< bit 21 */
#define NVIC_ICPR_CLRPEND_22            (0x00400000U)                           /*!< bit 22 */
#define NVIC_ICPR_CLRPEND_23            (0x00800000U)                           /*!< bit 23 */
#define NVIC_ICPR_CLRPEND_24            (0x01000000U)                           /*!< bit 24 */
#define NVIC_ICPR_CLRPEND_25            (0x02000000U)                           /*!< bit 25 */
#define NVIC_ICPR_CLRPEND_26            (0x04000000U)                           /*!< bit 26 */
#define NVIC_ICPR_CLRPEND_27            (0x08000000U)                           /*!< bit 27 */
#define NVIC_ICPR_CLRPEND_28            (0x10000000U)                           /*!< bit 28 */
#define NVIC_ICPR_CLRPEND_29            (0x20000000U)                           /*!< bit 29 */
#define NVIC_ICPR_CLRPEND_30            (0x40000000U)                           /*!< bit 30 */
#define NVIC_ICPR_CLRPEND_31            (0x80000000U)                           /*!< bit 31 */

/**
  * @brief NVIC_IABR Register Bit Definition
  */
#define NVIC_IABR_ACTIVE                (0xFFFFFFFFU)                           /*!< Interrupt active flags */
#define NVIC_IABR_ACTIVE_0              (0x00000001U)                           /*!< bit 0 */
#define NVIC_IABR_ACTIVE_1              (0x00000002U)                           /*!< bit 1 */
#define NVIC_IABR_ACTIVE_2              (0x00000004U)                           /*!< bit 2 */
#define NVIC_IABR_ACTIVE_3              (0x00000008U)                           /*!< bit 3 */
#define NVIC_IABR_ACTIVE_4              (0x00000010U)                           /*!< bit 4 */
#define NVIC_IABR_ACTIVE_5              (0x00000020U)                           /*!< bit 5 */
#define NVIC_IABR_ACTIVE_6              (0x00000040U)                           /*!< bit 6 */
#define NVIC_IABR_ACTIVE_7              (0x00000080U)                           /*!< bit 7 */
#define NVIC_IABR_ACTIVE_8              (0x00000100U)                           /*!< bit 8 */
#define NVIC_IABR_ACTIVE_9              (0x00000200U)                           /*!< bit 9 */
#define NVIC_IABR_ACTIVE_10             (0x00000400U)                           /*!< bit 10 */
#define NVIC_IABR_ACTIVE_11             (0x00000800U)                           /*!< bit 11 */
#define NVIC_IABR_ACTIVE_12             (0x00001000U)                           /*!< bit 12 */
#define NVIC_IABR_ACTIVE_13             (0x00002000U)                           /*!< bit 13 */
#define NVIC_IABR_ACTIVE_14             (0x00004000U)                           /*!< bit 14 */
#define NVIC_IABR_ACTIVE_15             (0x00008000U)                           /*!< bit 15 */
#define NVIC_IABR_ACTIVE_16             (0x00010000U)                           /*!< bit 16 */
#define NVIC_IABR_ACTIVE_17             (0x00020000U)                           /*!< bit 17 */
#define NVIC_IABR_ACTIVE_18             (0x00040000U)                           /*!< bit 18 */
#define NVIC_IABR_ACTIVE_19             (0x00080000U)                           /*!< bit 19 */
#define NVIC_IABR_ACTIVE_20             (0x00100000U)                           /*!< bit 20 */
#define NVIC_IABR_ACTIVE_21             (0x00200000U)                           /*!< bit 21 */
#define NVIC_IABR_ACTIVE_22             (0x00400000U)                           /*!< bit 22 */
#define NVIC_IABR_ACTIVE_23             (0x00800000U)                           /*!< bit 23 */
#define NVIC_IABR_ACTIVE_24             (0x01000000U)                           /*!< bit 24 */
#define NVIC_IABR_ACTIVE_25             (0x02000000U)                           /*!< bit 25 */
#define NVIC_IABR_ACTIVE_26             (0x04000000U)                           /*!< bit 26 */
#define NVIC_IABR_ACTIVE_27             (0x08000000U)                           /*!< bit 27 */
#define NVIC_IABR_ACTIVE_28             (0x10000000U)                           /*!< bit 28 */
#define NVIC_IABR_ACTIVE_29             (0x20000000U)                           /*!< bit 29 */
#define NVIC_IABR_ACTIVE_30             (0x40000000U)                           /*!< bit 30 */
#define NVIC_IABR_ACTIVE_31             (0x80000000U)                           /*!< bit 31 */

/**
  * @brief NVIC_PRI0 Register Bit Definition
  */
#define NVIC_IPR0_PRI_0                 (0x000000FFU)                           /*!< Priority of interrupt 0 */
#define NVIC_IPR0_PRI_1                 (0x0000FF00U)                           /*!< Priority of interrupt 1 */
#define NVIC_IPR0_PRI_2                 (0x00FF0000U)                           /*!< Priority of interrupt 2 */
#define NVIC_IPR0_PRI_3                 (0xFF000000U)                           /*!< Priority of interrupt 3 */

/**
  * @brief NVIC_PRI1 Register Bit Definition
  */
#define NVIC_IPR1_PRI_4                 (0x000000FFU)                           /*!< Priority of interrupt 4 */
#define NVIC_IPR1_PRI_5                 (0x0000FF00U)                           /*!< Priority of interrupt 5 */
#define NVIC_IPR1_PRI_6                 (0x00FF0000U)                           /*!< Priority of interrupt 6 */
#define NVIC_IPR1_PRI_7                 (0xFF000000U)                           /*!< Priority of interrupt 7 */

/**
  * @brief NVIC_PRI2 Register Bit Definition
  */
#define NVIC_IPR2_PRI_8                 (0x000000FFU)                           /*!< Priority of interrupt 8 */
#define NVIC_IPR2_PRI_9                 (0x0000FF00U)                           /*!< Priority of interrupt 9 */
#define NVIC_IPR2_PRI_10                (0x00FF0000U)                           /*!< Priority of interrupt 10 */
#define NVIC_IPR2_PRI_11                (0xFF000000U)                           /*!< Priority of interrupt 11 */

/**
  * @brief NVIC_PRI3 Register Bit Definition
  */
#define NVIC_IPR3_PRI_12                (0x000000FFU)                           /*!< Priority of interrupt 12 */
#define NVIC_IPR3_PRI_13                (0x0000FF00U)                           /*!< Priority of interrupt 13 */
#define NVIC_IPR3_PRI_14                (0x00FF0000U)                           /*!< Priority of interrupt 14 */
#define NVIC_IPR3_PRI_15                (0xFF000000U)                           /*!< Priority of interrupt 15 */

/**
  * @brief NVIC_PRI4 Register Bit Definition
  */
#define NVIC_IPR4_PRI_16                (0x000000FFU)                           /*!< Priority of interrupt 16 */
#define NVIC_IPR4_PRI_17                (0x0000FF00U)                           /*!< Priority of interrupt 17 */
#define NVIC_IPR4_PRI_18                (0x00FF0000U)                           /*!< Priority of interrupt 18 */
#define NVIC_IPR4_PRI_19                (0xFF000000U)                           /*!< Priority of interrupt 19 */

/**
  * @brief NVIC_PRI5 Register Bit Definition
  */
#define NVIC_IPR5_PRI_20                (0x000000FFU)                           /*!< Priority of interrupt 20 */
#define NVIC_IPR5_PRI_21                (0x0000FF00U)                           /*!< Priority of interrupt 21 */
#define NVIC_IPR5_PRI_22                (0x00FF0000U)                           /*!< Priority of interrupt 22 */
#define NVIC_IPR5_PRI_23                (0xFF000000U)                           /*!< Priority of interrupt 23 */

/**
  * @brief NVIC_PRI6 Register Bit Definition
  */
#define NVIC_IPR6_PRI_24                (0x000000FFU)                           /*!< Priority of interrupt 24 */
#define NVIC_IPR6_PRI_25                (0x0000FF00U)                           /*!< Priority of interrupt 25 */
#define NVIC_IPR6_PRI_26                (0x00FF0000U)                           /*!< Priority of interrupt 26 */
#define NVIC_IPR6_PRI_27                (0xFF000000U)                           /*!< Priority of interrupt 27 */

/**
  * @brief NVIC_PRI7 Register Bit Definition
  */
#define NVIC_IPR7_PRI_28                (0x000000FFU)                           /*!< Priority of interrupt 28 */
#define NVIC_IPR7_PRI_29                (0x0000FF00U)                           /*!< Priority of interrupt 29 */
#define NVIC_IPR7_PRI_30                (0x00FF0000U)                           /*!< Priority of interrupt 30 */
#define NVIC_IPR7_PRI_31                (0xFF000000U)                           /*!< Priority of interrupt 31 */

/**
  * @brief NVIC_PRI8 Register Bit Definition
  */
#define NVIC_IPR7_PRI_32                (0x000000FFU)                           /*!< Priority of interrupt 32 */
#define NVIC_IPR7_PRI_33                (0x0000FF00U)                           /*!< Priority of interrupt 33 */
#define NVIC_IPR7_PRI_34                (0x00FF0000U)                           /*!< Priority of interrupt 34 */
#define NVIC_IPR7_PRI_35                (0xFF000000U)                           /*!< Priority of interrupt 35 */

/**
  * @brief NVIC_PRI9 Register Bit Definition
  */
#define NVIC_IPR7_PRI_36                (0x000000FFU)                           /*!< Priority of interrupt 36 */
#define NVIC_IPR7_PRI_37                (0x0000FF00U)                           /*!< Priority of interrupt 37 */
#define NVIC_IPR7_PRI_38                (0x00FF0000U)                           /*!< Priority of interrupt 38 */
#define NVIC_IPR7_PRI_39                (0xFF000000U)                           /*!< Priority of interrupt 39 */

